Flow_around_cylinder_trimmed_and_shortened_to_200_timesteps/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       8555;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       8585;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          110;
        startFace       8615;
    }
    obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       8725;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          8700;
        startFace       8845;
    }
)

// ************************************************************************* //
